package src.skarpen.lesson_5;

/**
 * Created by user on 28.12.2019.
 */
public class Lab5_3 {
    public static void main(String[] args) {
       /*
        //3. Создайте программу, выводящую на экран все неотрицательные элементы последовательности 90 85 80 75 70 65 60 ….
        for (int b = 90; b > 0; b = b - 5) {
            System.out.print(b + " ");
        }

        */
    }
}