package src.skarpen.lesson_5;

/**
 * Created by user on 28.12.2019.
 */
public class Lab5_2 {
    public static void main(String[] args) {


//2. Создайте программу, выводящую на экран первые 55 элементов последовательности 1 3 5 7 9 11 13 15 17 ….
        for (int a = 1, n = 0; n < 55; a = a + 2, n++) {
            System.out.println(a + " ");
        }
    }
}
