package src.skarpen.lesson_5;

/**
 * Created by user on 28.12.2019.
 */
public class Lab5_2 {
    public static void main(String[] args) {


//2. Создайте программу, выводящую на экран первые 55 элементов последовательности 1 3 5 7 9 11 13 15 17 ….
        int[] arr = new int[55];
        for (int i = 0, a = 1; i < arr.length; i++, a = a + 2){
            System.out.println(a + " ");

        }


    }
}
