package src.skarpen.lesson_5;

/**
 * Created by user on 28.12.2019.
 */
public class Lab5_1 {
    public static void main(String[] args) {

        //    1. Создайте программу, выводящую на экран все четырёхзначные числа последовательности 1000 1003 1006 1009 1012 1015 ….
        for (int i = 1000; i < 1016; i += 3) {
            System.out.println(i);
        }
    }}
