package src.skarpen.lesson_5;

/**
 * Created by user on 28.12.2019.
 */
public class Lab5_4 {
    public static void main(String[] args) {

        //4. Создайте программу, выводящую на экран первые 20 элементов последовательности 2 4 8 16 32 64 128 ….
        for (int c = 2, p = 0; p <= 20; c = c * 2, p++) System.out.println(c + " ");
    }
}
