package riliuchik.lab1;

//Напишите программу, которая выводит на экран "Hello World!".

public class Lab1_taskA1 {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}