package riliuchik.lab1_concept_of_OOP;

//Напишите тело main программы, которая выводит на экран 5 строк "Я начинаю изучать Java!".

public class Lab1_taskA2 {
    public static void main(String[] args) {
        System.out.println("Я начинаю изучать Java!");
        System.out.println("Я начинаю изучать Java!");
        System.out.println("Я начинаю изучать Java!");
        System.out.println("Я начинаю изучать Java!");
        System.out.println("Я начинаю изучать Java!");
    }
}