package src.riliuchik.lab1_concept_of_OOP;

//Напишите программу, которая рассчитывает и печатает выражение "3*3+4*4=25".

public class Lab1_taskA3 {
    public static void main(String[] args) {
        int i = 2;
        int j = 3;
        int k = i + j;
        System.out.println(j + "*" + j + "+" + i * i + "*" + i * i + "=" + k * k);
    }
}